RailsApp01/app/controllers/auth_controller.rb

    def login_post
        if session[:user]
            redirect_to("/")
        else
            email = params[:email]
            pass = Digest::SHA256.hexdigest(params[:pass])
            if User.find_by(email: email).nil?
                flash[:error] = "※ メールアドレスが存在しません。"
                redirect_to("/login")
            elsif User.find_by(email: email).pass != pass
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mail1@railsmail.com' LIMIT 1

    def signin_post
        if session[:user]
            redirect_to("/")
        else
            email = params[:email]
            pass = Digest::SHA256.hexdigest(params[:pass])
            name = params[:name]
            if User.find_by(email: email)
                flash[:error] = "※ そのメールアドレスは重複のため使用できません。"
                redirect_to("/signin")
            else
                User.create(email: email, pass: pass, name: name)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mail1@railsmail.com' LIMIT 1
INSERT INTO `users` (`name`, `email`, `pass`, `created_at`, `updated_at`) VALUES ('username1', 'mail1@railsmail.com', '65b2fd926b91ee545279ed0e8643a54775b029476fb925e2497d993e8a5c3b27', '2023-10-17 05:38:34.248077', '2023-10-17 05:38:34.248077')

    def signout
        if session[:user]
            Article.where(user: session[:user]).destroy_all
            User.find_by(email: session[:user]).destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 9
DELETE FROM `users` WHERE `users`.`id` = 5
SELECT `articles`.* FROM `articles` WHERE `articles`.`user` = 'mail1@railsmail.com'
DELETE FROM `users` WHERE `users`.`id` = 9
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mail1@railsmail.com' LIMIT 1