RailsApp01/app/controllers/blog_controller.rb

    def articles
        if session[:user]
            @articles = Article.all
---
SELECT `articles`.* FROM `articles`

    def new_article_post
        if session[:user]
            title = params[:title]
            body = params[:body]
            user = session[:user]
            Article.create(title: title, body: body, user: user)
---
INSERT INTO `articles` (`title`, `body`, `user`, `created_at`, `updated_at`) VALUES ('title1', 'body1', 'mail1@railsmail.com', '2023-10-08 07:35:22.728616', '2023-10-08 07:35:22.728616')

    def edit_article
        if session[:user] && Article.find_by(id: params[:id]).user == session[:user]
            @article = Article.find_by(id: params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1

    def edit_article_post
        if session[:user]
            id = params[:id]
            title = params[:title]
            body = params[:body]
            article = Article.find_by(id: id)
            article.update(title: title, body: body)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'タイトル２', `articles`.`body` = '内容２', `articles`.`updated_at` = '2023-10-08 07:36:32.595517' WHERE `articles`.`id` = 5

    def delete_article
        if session[:user] && Article.find_by(id: params[:id]).user == session[:user]
            Article.find_by(id: params[:id]).destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1