RailsApp01/app/controllers/index_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'mail1@railsmail.com' LIMIT 1
---
    def index
        if session[:user]
            @you = User.find_by(email: session[:user]).name